{
  "AboutMe": "I’m a backend-focused software engineer with a strong interest in data-driven systems. I primarily work with Java and Spring Boot, and I especially enjoy designing database models and building applications around them. I tend to think of backend and data work as complex puzzles — I like breaking large, ambiguous problems into smaller, solvable parts, and then watching everything come together into something reliable, scalable, and useful.\n\nAlongside backend engineering, I actively enjoy data work — including data modeling, pipeline design, analytics, and hands-on exploration. I’m particularly drawn to building systems with analytics in mind from the start, so that data can be meaningfully analyzed later instead of treated as an afterthought. This perspective shapes how I approach schema design, API boundaries, and system architecture.\n\nMy path into software wasn’t traditional, but it was deliberate. I started by learning SQL and database fundamentals, then moved into Java and backend development through formal coursework, an intensive bootcamp, and a significant amount of independent project work. Over time, I realized that I learn best by building real systems — tying concepts together through practical application instead of isolated theory. That approach has shaped how I think, how I learn, and how I engineer.\n\nOne of my core projects is a multi-tenant photography platform that I designed and built from the ground up. It’s been a challenging and rewarding process that has pushed me to grow across system design, data modeling, infrastructure, and long-term maintainability. More than anything, it confirmed for me that this is the kind of work I want to do: building thoughtful systems that have real impact and room to evolve.\n\nOutside of software, I’m a photographer (with a particular love for landscape and astrophotography), a classically trained clarinetist and pianist, and someone who enjoys being outdoors, exploring new places, and learning about languages and ancient history. These interests influence how I think about structure, patterns, and long-term craft — both in creative work and in engineering.\n\nI care deeply about building things well, learning continuously, and taking on problems that are challenging and meaningful. I’m motivated by growth, by impact, and by the opportunity to contribute to systems that matter — and I’m excited to keep doing that wherever I have the chance."
}